In [1]:
import pandas as pd

In [4]:
pd.Series([2,1,3,5], index=['A','B','C','D'])

A    2
B    1
C    3
D    5
dtype: int64

In [5]:
import numpy as np

In [6]:
age = np.random.randint(18,50,50)
series = pd.Series(age)

In [8]:
series[0]

45

In [9]:
series[0:5]

0    45
1    46
2    28
3    19
4    41
dtype: int64

In [12]:
series.head(2)

0    45
1    46
dtype: int64

In [13]:
series.tail(2)

48    22
49    22
dtype: int64

In [14]:
series.mean()

32.04

In [17]:
data = {
    "names" : ["John","Mac","Sam","Nick","Peter","Tim"],
    "sal" : [45000,56000,76000,34000,55000,40000],
    "dept" : ["IT","IT","HR","HR","IT","HR"]
}

In [26]:
df = pd.DataFrame(data, index=['E1','E2','E3','E4','E5','E6'])

In [27]:
df.shape

(6, 3)

In [28]:
df.columns

Index(['names', 'sal', 'dept'], dtype='object')

In [29]:
df.head()

    names    sal dept
E1   John  45000   IT
E2    Mac  56000   IT
E3    Sam  76000   HR
E4   Nick  34000   HR
E5  Peter  55000   IT

In [30]:
df['names']

E1     John
E2      Mac
E3      Sam
E4     Nick
E5    Peter
E6      Tim
Name: names, dtype: object

In [32]:
df.loc['E1']

names     John
sal      45000
dept        IT
Name: E1, dtype: object

In [33]:
df.iloc[0]

names     John
sal      45000
dept        IT
Name: E1, dtype: object

In [34]:
df.iloc[0:3]

   names    sal dept
E1  John  45000   IT
E2   Mac  56000   IT
E3   Sam  76000   HR

In [36]:
df.iloc[0:3, 0:2]

   names    sal
E1  John  45000
E2   Mac  56000
E3   Sam  76000

In [37]:
df.names

E1     John
E2      Mac
E3      Sam
E4     Nick
E5    Peter
E6      Tim
Name: names, dtype: object

In [38]:
df

    names    sal dept
E1   John  45000   IT
E2    Mac  56000   IT
E3    Sam  76000   HR
E4   Nick  34000   HR
E5  Peter  55000   IT
E6    Tim  40000   HR

In [39]:
df['sal'] > 50000

E1    False
E2     True
E3     True
E4    False
E5     True
E6    False
Name: sal, dtype: bool

In [40]:
df[df['sal'] > 50000]

    names    sal dept
E2    Mac  56000   IT
E3    Sam  76000   HR
E5  Peter  55000   IT

In [41]:
df[df['dept'] == "IT"]

    names    sal dept
E1   John  45000   IT
E2    Mac  56000   IT
E5  Peter  55000   IT

In [42]:
df[(df['dept'] == "IT") & (df['sal'] > 50000)]

    names    sal dept
E2    Mac  56000   IT
E5  Peter  55000   IT

In [45]:
df[df.sal > 45000]

    names    sal dept
E2    Mac  56000   IT
E3    Sam  76000   HR
E5  Peter  55000   IT